Repository: ferrantealberto/wp-curiosity
Catalog: languages/curiosity-generator-*.po
Languages: it_it

source: Curiosity Generator
it_it: Generatore di Curiosità

source: Generates curiosities on-demand using LLMs via OpenRouter, integrates Adsense, and includes a user credit system.
it_it: Genera curiosità su richiesta utilizzando LLM tramite OpenRouter, integra Adsense e include un sistema di crediti utente.

source: Curiosities generated successfully!
it_it: Curiosità generate con successo!

source: Generate Curiosities
it_it: Genera Curiosità

source: Discover fascinating facts and curiosities!
it_it: Scopri fatti e curiosità affascinanti!

source: Please configure your OpenRouter API key in the plugin settings.
it_it: Configura la tua chiave API OpenRouter nelle impostazioni del plugin.

source: The curiosity generator is currently unavailable. Please try again later.
it_it: Il generatore di curiosità non è attualmente disponibile. Riprova più tardi.

source: Historical Facts
it_it: Fatti Storici

source: Science & Nature
it_it: Scienza e Natura

source: Technology
it_it: Tecnologia

source: Art & Culture
it_it: Arte e Cultura

source: Geography
it_it: Geografia

source: Famous People
it_it: Personaggi Famosi

source: Mysteries
it_it: Misteri

source: Amazing Statistics
it_it: Statistiche Incredibili

source: Word Origins
it_it: Origine delle Parole

source: Bizarre Traditions
it_it: Tradizioni Bizzarre

source: Your Credits: %s
it_it: I tuoi Crediti: %s

source: Keyword or Theme
it_it: Parola Chiave o Tema

source: e.g., Space, Dinosaurs, Renaissance
it_it: es., Spazio, Dinosauri, Rinascimento

source: Curiosity Type
it_it: Tipo di Curiosità

source: Select a type
it_it: Seleziona un tipo

source: Time Period (Optional)
it_it: Periodo Temporale (Opzionale)

source: e.g., 19th Century, 1980s, Medieval
it_it: es., XIX Secolo, Anni '80, Medioevo

source: Show Advanced Options
it_it: Mostra Opzioni Avanzate

source: Location or Geographic Context (Optional)
it_it: Luogo o Contesto Geografico (Opzionale)

source: e.g., Italy, Amazon Rainforest, Urban areas
it_it: es., Italia, Foresta Amazzonica, Aree urbane

source: Specific Person or Group (Optional)
it_it: Persona o Gruppo Specifico (Opzionale)

source: e.g., Einstein, Indigenous peoples, Astronomers
it_it: es., Einstein, Popoli indigeni, Astronomi

source: Aspect or Focus (Optional)
it_it: Aspetto o Focus (Opzionale)

source: e.g., Cultural impact, Records, Innovations
it_it: es., Impatto culturale, Record, Innovazioni

source: Tone (Optional)
it_it: Tono (Opzionale)

source: Select a tone
it_it: Seleziona un tono

source: Humorous
it_it: Umoristico

source: Serious
it_it: Serio

source: Surprising
it_it: Sorprendente

source: Little-known
it_it: Poco conosciuto

source: Source Type (Optional)
it_it: Tipo di Fonte (Opzionale)

source: Select a source type
it_it: Seleziona un tipo di fonte

source: Scientific studies
it_it: Studi scientifici

source: Historical records
it_it: Documenti storici

source: Popular legends
it_it: Leggende popolari

source: Recent discoveries
it_it: Scoperte recenti

source: Target Audience (Optional)
it_it: Pubblico di Riferimento (Opzionale)

source: Select an audience
it_it: Seleziona un pubblico

source: General public
it_it: Pubblico generale

source: Children
it_it: Bambini

source: Subject experts
it_it: Esperti del settore

source: Enthusiasts
it_it: Appassionati

source: Custom Parameter 1 (Optional)
it_it: Parametro Personalizzato 1 (Opzionale)

source: Custom parameter value
it_it: Valore del parametro personalizzato

source: Custom Parameter 2 (Optional)
it_it: Parametro Personalizzato 2 (Opzionale)

source: Number of Curiosities
it_it: Numero di Curiosità

source: Generate up to %d curiosities at once.
it_it: Genera fino a %d curiosità alla volta.

source: Generating curiosities...
it_it: Generazione di curiosità in corso...

source: Generated Curiosities
it_it: Curiosità Generate

source: Generate More
it_it: Genera Altre

source: Curiosity Generator Settings
it_it: Impostazioni Generatore di Curiosità

source: API Settings
it_it: Impostazioni API

source: Ads Settings
it_it: Impostazioni Annunci

source: Credits Settings
it_it: Impostazioni Crediti

source: General Settings
it_it: Impostazioni Generali

source: OpenRouter API Settings
it_it: Impostazioni API OpenRouter

source: Enter your OpenRouter API key and select the LLM model to use for generating curiosities.
it_it: Inserisci la tua chiave API OpenRouter e seleziona il modello LLM da utilizzare per generare curiosità.

source: API Key
it_it: Chiave API

source: Get your API key from
it_it: Ottieni la tua chiave API da

source: LLM Model
it_it: Modello LLM

source: Select the LLM model to use for generating curiosities. Higher quality models may cost more credits at OpenRouter.
it_it: Seleziona il modello LLM da utilizzare per generare curiosità. I modelli di qualità superiore potrebbero costare più crediti su OpenRouter.

source: AdSense Settings
it_it: Impostazioni AdSense

source: Configure your AdSense ads for the curiosity generator.
it_it: Configura i tuoi annunci AdSense per il generatore di curiosità.

source: Inline Ad Code
it_it: Codice Annuncio Inline

source: Enter your AdSense code for inline ads. These will appear before and after the curiosities.
it_it: Inserisci il tuo codice AdSense per gli annunci inline. Questi appariranno prima e dopo le curiosità.

source: Fullscreen Ad Code
it_it: Codice Annuncio a Schermo Intero

source: Enter your AdSense code for fullscreen ads. These will appear after the first generation, after the last curiosity in a batch, and at the frequency set below.
it_it: Inserisci il tuo codice AdSense per gli annunci a schermo intero. Questi appariranno dopo la prima generazione, dopo l'ultima curiosità in un batch e alla frequenza impostata di seguito.

source: Fullscreen Ad Frequency
it_it: Frequenza Annunci a Schermo Intero

source: How often to show fullscreen ads (e.g., every 5 batches of curiosities).
it_it: Con quale frequenza mostrare gli annunci a schermo intero (es. ogni 5 batch di curiosità).

source: Configure the credit system for logged-in users.
it_it: Configura il sistema di crediti per gli utenti registrati.

source: Generation Credits
it_it: Crediti per Generazione

source: How many credits a user earns for generating a batch of curiosities.
it_it: Quanti crediti guadagna un utente per la generazione di un batch di curiosità.

source: View Credits
it_it: Crediti per Visualizzazione

source: How many credits a user earns when someone views a curiosity they generated.
it_it: Quanti crediti guadagna un utente quando qualcuno visualizza una curiosità da loro generata.

source: Configure general settings for the curiosity generator.
it_it: Configura le impostazioni generali per il generatore di curiosità.

source: Max Curiosities
it_it: Numero Massimo di Curiosità

source: Maximum number of curiosities that can be generated at once (1-20).
it_it: Numero massimo di curiosità che possono essere generate contemporaneamente (1-20).

source: Min Curiosity Length
it_it: Lunghezza Minima Curiosità

source: Minimum length (in words) for each generated curiosity.
it_it: Lunghezza minima (in parole) per ogni curiosità generata.

source: Default Author
it_it: Autore Predefinito

source: The default author for curiosities generated by non-logged-in users.
it_it: L'autore predefinito per le curiosità generate da utenti non registrati.

source: Error:
it_it: Errore:

source: Hide Advanced Options
it_it: Nascondi Opzioni Avanzate

source: An error occurred. Please try again.
it_it: Si è verificato un errore. Riprova.
